## AWS Terraform Checks


#### ✅ Terraform Format and Style Passed
#### ✅ Terraform Initialization Passed
#### ✅ Terraform Validation Passed
#### ✅ Terraform Plan Passed
<details>
<summary><code>terraform plan</code> output</summary>

```text
tls_private_key.key: Refreshing state... [id=27eb3343e1e33cf36b2c32b742247d600f2e3fe9]
data.cloudflare_zone.site-zone: Reading...
data.aws_iam_policy_document.ec2-cloudwatch-logs: Reading...
aws_key_pair.key: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL]
aws_cloudwatch_log_group.log-group: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL]
data.aws_ami.ubuntu-jammy: Reading...
data.aws_iam_policy_document.ec2-cloudwatch-logs: Read complete after 0s [id=2851119427]
aws_security_group.allow-vpn: Refreshing state... [id=sg-018c691635110108f]
aws_iam_role.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_iam_policy.ec2-cloudwatch-logs: Refreshing state... [id=arn:aws:iam::803205869942:policy/KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_iam_instance_profile.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_iam_role_policy_attachment.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs-20230106063902346900000001]
data.cloudflare_zone.site-zone: Read complete after 1s [id=1896d1131a72f9255386a78c50024864]
data.aws_ami.ubuntu-jammy: Read complete after 1s [id=ami-01ec7354bd709968b]
aws_instance.node: Refreshing state... [id=i-0111ef14b25cde840]
aws_eip.ip: Refreshing state... [id=eipalloc-0013b25bd0edffa71]
cloudflare_record.record: Refreshing state... [id=3dbc3636104e97d4d629bffa81773460]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.ip will be updated in-place
  ~ resource "aws_eip" "ip" {
        id                   = "eipalloc-0013b25bd0edffa71"
      ~ instance             = "i-0111ef14b25cde840" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.node must be replaced
-/+ resource "aws_instance" "node" {
      ~ ami                                  = "ami-0fc7acf08c2238f38" -> "ami-01ec7354bd709968b" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:803205869942:instance/i-0111ef14b25cde840" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0111ef14b25cde840" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-08600ddd780843342" -> (known after apply)
      ~ private_dns                          = "ip-172-31-17-62.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.17.62" -> (known after apply)
      ~ public_dns                           = "ec2-174-129-33-73.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "174.129.33.73" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "KI5VMF-CLOUD-TUNNEL-vpn",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-04b4319a85e52ea7c" -> (known after apply)
        tags                                 = {
            "Name" = "KI5VMF-CLOUD-TUNNEL"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-04a97092f8396cf04" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>